package com.chichkanov.util;

/**
 * Created by chichkanov on 21/10/2017.
 * telegram - @chichkanov777
 */
public class JsonData {

    public static final String BUILDER_PACK_JSON = "{\n" +
            "     \"products\": [\n" +
            "        {\n" +
            "\"actualPrice\":\n" +
            "110.16098796774679,\n" +
            "\"category\":\n" +
            "\"Овощи\",\n" +
            "\"price\":\n" +
            "219,\n" +
            "\"product\":\n" +
            "\"Перец микс 400г упак\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "110.16098796774679,\n" +
            "\"category\":\n" +
            "\"Овощи\",\n" +
            "\"price\":\n" +
            "219,\n" +
            "\"product\":\n" +
            "\"Перец микс 400г упак\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "140.59954024931395,\n" +
            "\"category\":\n" +
            "\"Яйцо\",\n" +
            "\"price\":\n" +
            "198.4,\n" +
            "\"product\":\n" +
            "\"Яйцо куриное С1 Экстра Роскар 25шт\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "402.50871807695773,\n" +
            "\"category\":\n" +
            "\"Мясо и Птица\",\n" +
            "\"price\":\n" +
            "554,\n" +
            "\"product\":\n" +
            "\"Говядина тазобедренная часть п\\/ф духовая охлажденная кг\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "62.42745738421914,\n" +
            "\"category\":\n" +
            "\"Творожные изделия\",\n" +
            "\"price\":\n" +
            "95.4,\n" +
            "\"product\":\n" +
            "\"Творог Свежее завтра 5% 200г пак\"\n" +
            "}\n" +
            "     ],\n" +
            "     \"TransactionTime\": \"/Date(1508293693628+0300)/\"\n" +
            "  }";

    public static final String STUDENT_PACK_JSON = "{\n" +
            "     \"products\": [\n" +
            "        {\n" +
            "\"actualPrice\":\n" +
            "24.352490319848286,\n" +
            "\"category\":\n" +
            "\"Батончики, шоколадные яйца, драже\",\n" +
            "\"price\":\n" +
            "30.9,\n" +
            "\"product\":\n" +
            "\"Жев.драже в сах.глазури Skittles Кисломикс 38г\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "55.92552897580226,\n" +
            "\"category\":\n" +
            "\"Чипсы\",\n" +
            "\"price\":\n" +
            "80.4,\n" +
            "\"product\":\n" +
            "\"Чипсы кукурузные Nachos оригинальные 150г\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "87.97809868588023,\n" +
            "\"category\":\n" +
            "\"Котлеты, наггетсы, галеты\",\n" +
            "\"price\":\n" +
            "162.4,\n" +
            "\"product\":\n" +
            "\"Котлеты Ложкаревъ По-домашнему 500г\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "241.733636458746,\n" +
            "\"category\":\n" +
            "\"Пельмени, вареники, хинкали\",\n" +
            "\"price\":\n" +
            "415.5,\n" +
            "\"product\":\n" +
            "\"Пельмени Сибирская коллекция Классические 800г\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "43.52232046373763,\n" +
            "\"category\":\n" +
            "\"Лимонады, газированные напитки\",\n" +
            "\"price\":\n" +
            "74.7,\n" +
            "\"product\":\n" +
            "\"Напиток Fanta апельсин б\\/алк газ 1л пэт\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "88.92791723056133,\n" +
            "\"category\":\n" +
            "\"Котлеты, наггетсы, галеты\",\n" +
            "\"price\":\n" +
            "112,\n" +
            "\"product\":\n" +
            "\"Наггетсы Мираторг Классические 300г\"\n" +
            "}\n" +
            "     ],\n" +
            "     \"TransactionTime\": \"/Date(1508293693628+0300)/\"\n" +
            "  }";

    public static final String WOMAN_PACK_JSON = "{\n" +
            "     \"products\": [\n" +
            "        {\n" +
            "\"actualPrice\":\n" +
            "63.3253053889262,\n" +
            "\"category\":\n" +
            "\"Овощи\",\n" +
            "\"price\":\n" +
            "88,\n" +
            "\"product\":\n" +
            "\"Томат кг\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "149.22166749887245,\n" +
            "\"category\":\n" +
            "\"Рыба охлажденная и замороженная\",\n" +
            "\"price\":\n" +
            "221.5,\n" +
            "\"product\":\n" +
            "\"Лосось атлантический суповой набор охл кг\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "15.71176786632825,\n" +
            "\"category\":\n" +
            "\"Выпечка, изделия сдобные\",\n" +
            "\"price\":\n" +
            "30.4,\n" +
            "\"product\":\n" +
            "\"Ватрушка Волжский Пекарь 100г\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "61.37390743870937,\n" +
            "\"category\":\n" +
            "\"Йогурты и творожки\",\n" +
            "\"price\":\n" +
            "88.4,\n" +
            "\"product\":\n" +
            "\"Йогурт питьевой Вкуснотеево 1.5% 750г персик ТТ\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "84.69375210583385,\n" +
            "\"category\":\n" +
            "\"Предметы женской гигиены\",\n" +
            "\"price\":\n" +
            "152.9,\n" +
            "\"product\":\n" +
            "\"Тампоны Kotex Super 16шт\"\n" +
            "},\n" +
            "{\n" +
            "\"actualPrice\":\n" +
            "20.046727984513495,\n" +
            "\"category\":\n" +
            "\"Предметы женской гигиены\",\n" +
            "\"price\":\n" +
            "36.4,\n" +
            "\"product\":\n" +
            "\"Прокладки ежедневные Bella Panty Soft 20шт\"\n" +
            "}\n" +
            "     ],\n" +
            "     \"TransactionTime\": \"/Date(1508293693628+0300)/\"\n" +
            "  }";

}
